{ 
  "congratulation": "Félicitations!",
  "credits": "",
  "final-score": "Pointage final",
  "intro": "<p>De quelle couleur sera l'élément avec l'émoji ✋?</p>",
  "level": "Niveau",
  "next-question": "Question suivante",
  "of": "de",
  "questions-in-random-order": "Réessayez en mode aléatoire",
  "quiz-completed": "Quiz complété",
  "reset": "Recommencer",
  "score": "Pointage",
  "selector": "Sélecteur",
  "show-result": "Voir le résultat!",
  "slogan": "Un quiz amusant pour apprendre et pratiquer la spécificité en CSS.",
  "specificity": "Spécificité",
  "title": "Spécificité CSS",
  "questions": {
    "tag-vs-class": "Une classe a toujours priorité sur une balise HTML.",
    "tag-vs-id": "Un id a toujours priorité sur une balise HTML.",
    "class-vs-id": "Un id a toujours priorité sur une classe.",
    "class-vs-class": "Si plusieurs classes ont une spécificité équivalente, celle écrite en dernier a priorité sur les autres. Puisque le code est lu de haut en bas, la définition la plus récente est donc celle qui l'emporte.", 
    "class-order": "Si plusieurs classes sont identiques, elles ont une spécificité équivalente. Dans ce cas, celle écrite en dernier a priorité sur les autres. Puisque le code est lu de haut en bas, la définition la plus récente est donc celle qui l'emporte.",     
    "tag-and-class-vs-class": "Si plusieurs classes ont une spécificité équivalente, si l'une d'entre elles est combinée à une balise HTML, celle-ci a priorité sur les autres.",
    "class-and-class-vs-id": "Le pointage des deux classes s'additionne. Cependant, une spécificité de deux classes <em>(20pts)</em> n'est pas suffisant afin de dépasser la spécificité d'un id <em>(100pts)</em>.",
    "class-and-id-vs-id": "Le pointage du id et de la classe s'additionne. Donnant ainsi à ce sélecteur la priorité.",
    "tag-ancestor-and-tag-vs-class": "Bien que la spécificité des deux balises HTML s'additionne, leur total n'est pas suffisant afin de dépasser la spécificité d'une classe.", 
    "class-vs-style": "Les styles en ligne <em>(inline)</em> ont une spécificité élevée les rendant difficiles à écraser subséquemment. Utilisez-les avec modération.",
    "id-vs-style": "Les styles en ligne <em>(inline)</em> ont une spécificité élevée les rendant difficiles à écraser subséquemment <em>(même avec un id)</em>. Utilisez-les avec modération.",
    "class-vs-class-ancestor": "Le sélecteur <code>.super</code> correspond à l'ancêtre de l'élément <code>.extra</code> et non à l'élément lui-même. Le modifier n'affecte donc pas <code>.extra</code>. <p>Par exemple, si votre père change de style en se teignant les cheveux, votre couleur de cheveux reste inchangée.</p>",
    "class-separation": "Coller deux classes indique que l'élément possède ces deux classes simultanément. <p>Tandis qu'un espace indique que l'élément de gauche est un élément ancêtre de l'élément de droite. Autrement dit, que deux éléments sont impliqués et non un seul.</p>",
    "class-ancestor-and-class-vs-class": "Ajouter une classe ancêtre à un sélecteur le rend plus précis et donc lui donne priorité sur un sélecteur simple.",
    "class-ancestor-order": "Un sélecteur CSS est lu de droite à gauche. Donc l'élément ciblé devrait toujours se trouver en dernier et non au début.",
    "class-and-class-vs-class": "Le pointage des deux classes s'additionne. Donnant ainsi à ce sélecteur la priorité.",
    "universal-vs-class": "Le sélecteur universel <em>(*)</em> n'a aucune valeur de spécificité, donc tous les autres sélecteurs ont une priorité plus grande que celui-ci.",
    "pseudo-class-vs-class": "Une pseudo-classe à la même valeur qu'une classe, donc combiné à cette dernière sa valeur de spécificité est plus grande que celle d'une classe seule.",
    "pseudo-class-vs-id": "Même survolé, la couleur de l'élément restera celle définit par le id puisque sa spécificité reste plus grande.",
    "class-double-vs-class": "Répéter 2x une classe renforce un sélecteur, doublant ainsi sa spécificité.<p>Cette technique ne devrait être utilisée qu'en dernier recours.</p>"
  }
}